CAVeRobotics/CAVeware/bsp/boards/STM32-E407/rover_config/src/rover_imu_config.c
#include "rover_imu_config.h"

#include <stdbool.h>
#include <stdint.h>

#include "lsm6dsv16x_reg.h"
#include "spi.h"
#include "stm32f4xx_hal.h"

#include "bsp.h"
#include "bsp_gpio.h"
#include "bsp_gpio_user.h"
#include "bsp_logger.h"

#include "rover.h"

#define ROVER_IMU_CONFIG_BOOT_TIME                        (Bsp_Millisecond_t)10U
#define ROVER_IMU_CONFIG_TIMEOUT                          (Bsp_Millisecond_t)10U
#define ROVER_IMU_CONFIG_CALIBRATION_SETTLE_TIME          (Bsp_Millisecond_t)100U
#define ROVER_IMU_CONFIG_REGISTER_READ                    0x80U
#define ROVER_IMU_CONFIG_FS2_TO_METERS_PER_SECOND_SQUARED (double)5.985e-4
#define ROVER_IMU_CONFIG_125DPS_TO_RADIANS_PER_SECOND     (double)6.658e-5
#define ROVER_IMU_CONFIG_ERROR_NONE                       (int32_t)0
#define ROVER_IMU_MILLIG_TO_G                             1e3

typedef int32_t RoverImuConfig_Error_t;
typedef int16_t RoverImuConfig_RawData_t;

typedef enum
{
    ROVER_IMU_CONFIG_AXIS_X,
    ROVER_IMU_CONFIG_AXIS_Y,
    ROVER_IMU_CONFIG_AXIS_Z,
    ROVER_IMU_CONFIG_AXIS_MAX
} RoverImuConfig_Axis_t;

typedef enum
{
    ROVER_IMU_CONFIG_QUATERION_AXIS_W,
    ROVER_IMU_CONFIG_QUATERION_AXIS_X,
    ROVER_IMU_CONFIG_QUATERION_AXIS_Y,
    ROVER_IMU_CONFIG_QUATERION_AXIS_Z,
    ROVER_IMU_CONFIG_QUATERION_AXIS_MAX
} RoverImuConfig_QuaterionAxis_t;

typedef enum
{
    ROVER_IMU_CONFIG_FIFO_DATA_X = 0U,
    ROVER_IMU_CONFIG_FIFO_DATA_Y = 2U,
    ROVER_IMU_CONFIG_FIFO_DATA_Z = 4U,
    ROVER_IMU_CONFIG_FIFO_DATA_MAX = 6U
} RoverImuConfig_FifoData_t;

static const char *kRoverImuConfig_LogTag = "ROVER IMU CONFIG";

static int32_t RoverImuConfig_Write(void *const handle, const uint8_t imu_register, const uint8_t *const data, const uint16_t size);
static int32_t RoverImuConfig_Read(void *const handle, const uint8_t imu_register, uint8_t *const data, const uint16_t size);
static Rover_Error_t RoverImuConfig_ReadAll(void);
static Rover_Error_t RoverImuConfig_ReadFifo(void);
static inline Rover_Error_t RoverImuConfig_ImuToRoverError(const RoverImuConfig_Error_t error);
static inline float RoverImuConfig_FsToMilliG(const RoverImuConfig_RawData_t fs);
static inline Rover_MetersPerSecondSquared_t RoverImuConfig_Fs2ToMetersPerSecondSquared(const RoverImuConfig_RawData_t fs2);
static inline Rover_MetersPerSecondSquared_t RoverImuConfig_125dpsToRadiansPerSecond(const RoverImuConfig_RawData_t dps);

/* Third-party code to handle SFLP quaterion conversion
   Non-compliant, DO NOT MODIFY
   Source: https://github.com/STMicroelectronics/STMems_Standard_C_drivers/blob/master/lsm6dsv16x_STdC/examples/lsm6dsv16x_sensor_fusion.c
 */
static float_t npy_half_to_float(uint16_t h);
static void sflp2q(float_t quat[4], const uint16_t sflp[3]);

static stmdev_ctx_t RoverImuConfig_DeviceHandle = {
    .write_reg = RoverImuConfig_Write,
    .read_reg  = RoverImuConfig_Read,
    .mdelay    = Bsp_Delay,
    .handle    = &hspi1,
};

static RoverImuConfig_RawData_t RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_MAX] = {
    [ROVER_IMU_CONFIG_AXIS_X] = 0,
    [ROVER_IMU_CONFIG_AXIS_Y] = 0,
    [ROVER_IMU_CONFIG_AXIS_Z] = 0
};
static RoverImuConfig_RawData_t RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_MAX] = {
    [ROVER_IMU_CONFIG_AXIS_X] = 0,
    [ROVER_IMU_CONFIG_AXIS_Y] = 0,
    [ROVER_IMU_CONFIG_AXIS_Z] = 0
};
static double                   RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_MAX] = {
    [ROVER_IMU_CONFIG_QUATERION_AXIS_W] = 0.0,
    [ROVER_IMU_CONFIG_QUATERION_AXIS_X] = 0.0,
    [ROVER_IMU_CONFIG_QUATERION_AXIS_Y] = 0.0,
    [ROVER_IMU_CONFIG_QUATERION_AXIS_Z] = 0.0
};

/* Onboard registers may not have enough precision to store offset */
static RoverImuConfig_RawData_t RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_MAX] = {
    [ROVER_IMU_CONFIG_AXIS_X] = 0,
    [ROVER_IMU_CONFIG_AXIS_Y] = 0,
    [ROVER_IMU_CONFIG_AXIS_Z] = 0
};
static RoverImuConfig_RawData_t RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_MAX] = {
    [ROVER_IMU_CONFIG_AXIS_X] = 0,
    [ROVER_IMU_CONFIG_AXIS_Y] = 0,
    [ROVER_IMU_CONFIG_AXIS_Z] = 0
};

Rover_Error_t RoverImuConfig_Initialize(void)
{
    RoverImuConfig_Error_t error = ROVER_IMU_CONFIG_ERROR_NONE;

    /* Wait sensor boot time */
    Bsp_Delay(ROVER_IMU_CONFIG_BOOT_TIME);

    /* Check device ID */
    uint8_t whoami = 0U;
    error |= lsm6dsv16x_device_id_get(&RoverImuConfig_DeviceHandle, &whoami);
    if (LSM6DSV16X_ID != whoami)
    {
        error = 1;

        BSP_LOGGER_LOG_ERROR(kRoverImuConfig_LogTag, "Failed to detect IMU");
    }
    else
    {
        BSP_LOGGER_LOG_DEBUG(kRoverImuConfig_LogTag, "IMU detected");

        /* Restore default configuration */
        BSP_LOGGER_LOG_DEBUG(kRoverImuConfig_LogTag, "Resetting IMU");
        lsm6dsv16x_reset_t imu_reset;
        error |= lsm6dsv16x_reset_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_RESTORE_CTRL_REGS);
        error |= lsm6dsv16x_reset_get(&RoverImuConfig_DeviceHandle, &imu_reset);
        while (LSM6DSV16X_READY != imu_reset)
        {
            error |= lsm6dsv16x_reset_get(&RoverImuConfig_DeviceHandle, &imu_reset);
        }
        BSP_LOGGER_LOG_DEBUG(kRoverImuConfig_LogTag, "IMU reset");

        /* Enable Block Data Update */
        error |= lsm6dsv16x_block_data_update_set(&RoverImuConfig_DeviceHandle, PROPERTY_ENABLE);

        /* Set Output Data Rate.
         * Selected data rate have to be equal or greater with respect
         * with MLC data rate.
         */
        error |= lsm6dsv16x_xl_data_rate_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_ODR_AT_7680Hz);
        error |= lsm6dsv16x_gy_data_rate_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_ODR_AT_7680Hz);

        /* Set full scale */
        error |= lsm6dsv16x_xl_full_scale_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_2g);
        error |= lsm6dsv16x_gy_full_scale_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_125dps);

        /* Configure filtering chain */
        lsm6dsv16x_filt_settling_mask_t filter_settling_mask;
        filter_settling_mask.drdy   = PROPERTY_ENABLE;
        filter_settling_mask.irq_xl = PROPERTY_ENABLE;
        filter_settling_mask.irq_g  = PROPERTY_ENABLE;
        error                      |= lsm6dsv16x_filt_settling_mask_set(&RoverImuConfig_DeviceHandle, filter_settling_mask);
        error                      |= lsm6dsv16x_filt_gy_lp1_set(&RoverImuConfig_DeviceHandle, PROPERTY_ENABLE);
        error                      |= lsm6dsv16x_filt_gy_lp1_bandwidth_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_GY_ULTRA_LIGHT);
        error                      |= lsm6dsv16x_filt_xl_lp2_set(&RoverImuConfig_DeviceHandle, PROPERTY_ENABLE);
        error                      |= lsm6dsv16x_filt_xl_lp2_bandwidth_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_XL_STRONG);

        /* Enable game rotation vector */
        lsm6dsv16x_fifo_sflp_raw_t fifo_sflp;
        fifo_sflp.game_rotation = 1;
        fifo_sflp.gravity       = 0;
        fifo_sflp.gbias         = 0;
        error                  |= lsm6dsv16x_fifo_sflp_batch_set(&RoverImuConfig_DeviceHandle, fifo_sflp);

        /* Set FIFO mode to Continuous mode */
        error |= lsm6dsv16x_fifo_mode_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_STREAM_MODE);

        /* Set Game Vector Output Data Rate */
        error |= lsm6dsv16x_sflp_data_rate_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_SFLP_480Hz);
        error |= lsm6dsv16x_sflp_game_rotation_set(&RoverImuConfig_DeviceHandle, PROPERTY_ENABLE);
    }

    if ((ROVER_IMU_CONFIG_ERROR_NONE != error) || (ROVER_ERROR_NONE != RoverImuConfig_Calibrate()))
    {
        error = 1;

