CAVeRobotics/CAVeware/bsp/boards/STM32-E407/rover_config/src/rover_imu_config.c
        BSP_LOGGER_LOG_ERROR(kRoverImuConfig_LogTag, "Failed to initialize");
    }
    else
    {

        BSP_LOGGER_LOG_DEBUG(kRoverImuConfig_LogTag, "Initialized");
    }

    return RoverImuConfig_ImuToRoverError(error);
}

Rover_Error_t RoverImuConfig_Calibrate(void)
{
    RoverImuConfig_Error_t      error       = ROVER_IMU_CONFIG_ERROR_NONE;
    lsm6dsv16x_fifo_status_t    fifo_status = {
        0U
    };
    uint16_t                    xl_samples                         = 0U;
    uint16_t                    gy_samples                         = 0U;
    int32_t                     xl_data[ROVER_IMU_CONFIG_AXIS_MAX] = {
        0U
    };
    int32_t                     gy_data[ROVER_IMU_CONFIG_AXIS_MAX] = {
        0U
    };
    int32_t                     gravity_offset = (int32_t)(ROVER_IMU_MILLIG_TO_G / RoverImuConfig_FsToMilliG(1));
    lsm6dsv16x_data_rate_t      xl_data_rate;
    lsm6dsv16x_data_rate_t      gy_data_rate;
    lsm6dsv16x_fifo_xl_batch_t  xl_fifo_batch;
    lsm6dsv16x_fifo_gy_batch_t  gy_fifo_batch;
    lsm6dsv16x_fifo_mode_t      fifo_mode;
    lsm6dsv16x_fifo_sflp_raw_t  fifo_sflp;
    lsm6dsv16x_sflp_data_rate_t sflp_data_rate;
    uint8_t                     game_rotation_enabled;

    BSP_LOGGER_LOG_DEBUG(kRoverImuConfig_LogTag, "Calibrating");

    /* Save existing data rate */
    error |= lsm6dsv16x_xl_data_rate_get(&RoverImuConfig_DeviceHandle, &xl_data_rate);
    error |= lsm6dsv16x_gy_data_rate_get(&RoverImuConfig_DeviceHandle, &gy_data_rate);
    error |= lsm6dsv16x_fifo_xl_batch_get(&RoverImuConfig_DeviceHandle, &xl_fifo_batch);
    error |= lsm6dsv16x_fifo_gy_batch_get(&RoverImuConfig_DeviceHandle, &gy_fifo_batch);

    /* Save exisitng FIFO mode */
    error |= lsm6dsv16x_fifo_mode_get(&RoverImuConfig_DeviceHandle, &fifo_mode);

    /* Save existing SFLP settings */
    error |= lsm6dsv16x_fifo_sflp_batch_get(&RoverImuConfig_DeviceHandle, &fifo_sflp);
    error |= lsm6dsv16x_sflp_data_rate_get(&RoverImuConfig_DeviceHandle, &sflp_data_rate);
    error |= lsm6dsv16x_sflp_game_rotation_get(&RoverImuConfig_DeviceHandle, &game_rotation_enabled);

    /* Set new data rate for calibration period (1s~2s) to fill FIFO */
    error |= lsm6dsv16x_xl_data_rate_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_ODR_AT_240Hz);
    error |= lsm6dsv16x_gy_data_rate_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_ODR_AT_240Hz);
    error |= lsm6dsv16x_fifo_xl_batch_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_XL_BATCHED_AT_240Hz);
    error |= lsm6dsv16x_fifo_gy_batch_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_GY_BATCHED_AT_240Hz);

    /* Disable SFLP */
    lsm6dsv16x_fifo_sflp_raw_t fifo_sflp_disabled;
    fifo_sflp_disabled.game_rotation = 0;
    fifo_sflp_disabled.gravity       = 0;
    fifo_sflp_disabled.gbias         = 0;
    error                           |= lsm6dsv16x_fifo_sflp_batch_set(&RoverImuConfig_DeviceHandle, fifo_sflp_disabled);
    error                           |= lsm6dsv16x_sflp_game_rotation_set(&RoverImuConfig_DeviceHandle, PROPERTY_DISABLE);

    Bsp_Delay(ROVER_IMU_CONFIG_CALIBRATION_SETTLE_TIME);

    /* Flush FIFO */
    error |= lsm6dsv16x_fifo_status_get(&RoverImuConfig_DeviceHandle, &fifo_status);
    for (uint16_t i = 0U; i < fifo_status.fifo_level; i++)
    {
        lsm6dsv16x_fifo_out_raw_t fifo_data;
        error |= lsm6dsv16x_fifo_out_raw_get(&RoverImuConfig_DeviceHandle, &fifo_data);
    }

    /* Set FIFO to FIFO mode */
    error |= lsm6dsv16x_fifo_mode_set(&RoverImuConfig_DeviceHandle, LSM6DSV16X_FIFO_MODE);

    /* Wait until FIFO is full */
    while (0U == fifo_status.fifo_full)
    {
        error |= lsm6dsv16x_fifo_status_get(&RoverImuConfig_DeviceHandle, &fifo_status);
    }

    /* Read and average FIFO samples */
    for (uint16_t i = 0U; i < fifo_status.fifo_level; i++)
    {
        lsm6dsv16x_fifo_out_raw_t fifo_data;
        error |= lsm6dsv16x_fifo_out_raw_get(&RoverImuConfig_DeviceHandle, &fifo_data);

        RoverImuConfig_RawData_t x = *(RoverImuConfig_RawData_t *)&fifo_data.data[ROVER_IMU_CONFIG_FIFO_DATA_X];
        RoverImuConfig_RawData_t y = *(RoverImuConfig_RawData_t *)&fifo_data.data[ROVER_IMU_CONFIG_FIFO_DATA_Y];
        RoverImuConfig_RawData_t z = *(RoverImuConfig_RawData_t *)&fifo_data.data[ROVER_IMU_CONFIG_FIFO_DATA_Z];

        switch (fifo_data.tag)
        {
        case LSM6DSV16X_XL_NC_TAG:
            xl_data[ROVER_IMU_CONFIG_AXIS_X] += (int32_t)x;
            xl_data[ROVER_IMU_CONFIG_AXIS_Y] += (int32_t)y;
            xl_data[ROVER_IMU_CONFIG_AXIS_Z] += (int32_t)z;
            xl_samples++;
            break;
        case LSM6DSV16X_GY_NC_TAG:
            gy_data[ROVER_IMU_CONFIG_AXIS_X] += (int32_t)x;
            gy_data[ROVER_IMU_CONFIG_AXIS_Y] += (int32_t)y;
            gy_data[ROVER_IMU_CONFIG_AXIS_Z] += (int32_t)z;
            gy_samples++;
            break;
        default:
            break;
        }
    }

    /* Calculate accelerometer offset */
    RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_X] = (int16_t)(xl_data[ROVER_IMU_CONFIG_AXIS_X] / (int32_t)xl_samples);
    RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_Y] = (int16_t)(xl_data[ROVER_IMU_CONFIG_AXIS_Y] / (int32_t)xl_samples);
    RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_Z] = (int16_t)((xl_data[ROVER_IMU_CONFIG_AXIS_Z] / (int32_t)xl_samples) - gravity_offset);

    /* Calculate gyroscope offset */
    RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_X] = (int16_t)(gy_data[ROVER_IMU_CONFIG_AXIS_X] / (int32_t)gy_samples);
    RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_Y] = (int16_t)(gy_data[ROVER_IMU_CONFIG_AXIS_Y] / (int32_t)gy_samples);
    RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_Z] = (int16_t)(gy_data[ROVER_IMU_CONFIG_AXIS_Z] / (int32_t)gy_samples);

    /* Restore data rate */
    error |= lsm6dsv16x_xl_data_rate_set(&RoverImuConfig_DeviceHandle, xl_data_rate);
    error |= lsm6dsv16x_gy_data_rate_set(&RoverImuConfig_DeviceHandle, gy_data_rate);
    error |= lsm6dsv16x_fifo_xl_batch_set(&RoverImuConfig_DeviceHandle, xl_fifo_batch);
    error |= lsm6dsv16x_fifo_gy_batch_set(&RoverImuConfig_DeviceHandle, gy_fifo_batch);

    /* Restore FIFO mode */
    error |= lsm6dsv16x_fifo_mode_set(&RoverImuConfig_DeviceHandle, fifo_mode);

    /* Restore SFLP settings */
    error |= lsm6dsv16x_fifo_sflp_batch_set(&RoverImuConfig_DeviceHandle, fifo_sflp);
    error |= lsm6dsv16x_sflp_data_rate_set(&RoverImuConfig_DeviceHandle, sflp_data_rate);
    error |= lsm6dsv16x_sflp_game_rotation_set(&RoverImuConfig_DeviceHandle, game_rotation_enabled);

