CAVeRobotics/CAVeware/bsp/boards/STM32-E407/rover_config/src/rover_imu_config.c
    if (ROVER_IMU_CONFIG_ERROR_NONE != error)
    {
        BSP_LOGGER_LOG_ERROR(kRoverImuConfig_LogTag, "Calibration failed");
    }
    else
    {
        BSP_LOGGER_LOG_DEBUG(kRoverImuConfig_LogTag, "Calibrated");
    }

    return RoverImuConfig_ImuToRoverError(error);
}

Rover_Error_t RoverImuConfig_ReadAccelerometer(Rover_AccelerometerReading_t *const reading)
{
    Rover_Error_t error = ROVER_ERROR_NULL;

    if (NULL != reading)
    {
        error = RoverImuConfig_ReadAll();

        reading->x = RoverImuConfig_Fs2ToMetersPerSecondSquared(RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_X]);
        reading->y = RoverImuConfig_Fs2ToMetersPerSecondSquared(RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_Y]);
        reading->z = RoverImuConfig_Fs2ToMetersPerSecondSquared(RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_Z]);
    }

    return error;
}

Rover_Error_t RoverImuConfig_ReadGyroscope(Rover_GyroscopeReading_t *const reading)
{
    Rover_Error_t error = ROVER_ERROR_NULL;

    if (NULL != reading)
    {
        error = RoverImuConfig_ReadAll();

        reading->x = RoverImuConfig_125dpsToRadiansPerSecond(RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_X]);
        reading->y = RoverImuConfig_125dpsToRadiansPerSecond(RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_Y]);
        reading->z = RoverImuConfig_125dpsToRadiansPerSecond(RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_Z]);
    }

    return error;
}

Rover_Error_t RoverImuConfig_ReadQuaterion(Rover_Quaternion_t *const quaternion)
{
    Rover_Error_t error = ROVER_ERROR_NULL;

    if (NULL != quaternion)
    {
        error = RoverImuConfig_ReadFifo();

        quaternion->w = RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_W];
        quaternion->x = RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_X];
        quaternion->y = RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_Y];
        quaternion->z = RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_Z];
    }

    return error;
}

static RoverImuConfig_Error_t RoverImuConfig_Write(void *const handle, const uint8_t imu_register, const uint8_t *const data, const uint16_t size)
{
    RoverImuConfig_Error_t error = ROVER_IMU_CONFIG_ERROR_NONE;

    if ((BSP_ERROR_NONE != BspGpio_Write(BSP_GPIO_USER_PIN_IMU_CS, BSP_GPIO_STATE_RESET)) ||
        (BSP_ERROR_NONE != (Bsp_Error_t)HAL_SPI_Transmit(handle, &imu_register, 1U, ROVER_IMU_CONFIG_TIMEOUT)) ||
        (BSP_ERROR_NONE != (Bsp_Error_t)HAL_SPI_Transmit(handle, data, size, ROVER_IMU_CONFIG_TIMEOUT)) ||
        (BSP_ERROR_NONE != BspGpio_Write(BSP_GPIO_USER_PIN_IMU_CS, BSP_GPIO_STATE_SET)))
    {
        error = 1;
    }

    return error;
}

static RoverImuConfig_Error_t RoverImuConfig_Read(void *const handle, const uint8_t imu_register, uint8_t *const data, const uint16_t size)
{
    RoverImuConfig_Error_t error         = ROVER_IMU_CONFIG_ERROR_NONE;
    uint8_t                register_read = imu_register | ROVER_IMU_CONFIG_REGISTER_READ;

    if ((BSP_ERROR_NONE != BspGpio_Write(BSP_GPIO_USER_PIN_IMU_CS, BSP_GPIO_STATE_RESET)) ||
        (BSP_ERROR_NONE != (Bsp_Error_t)HAL_SPI_Transmit(handle, &register_read, 1U, ROVER_IMU_CONFIG_TIMEOUT)) ||
        (BSP_ERROR_NONE != (Bsp_Error_t)HAL_SPI_Receive(handle, data, size, ROVER_IMU_CONFIG_TIMEOUT)) ||
        (BSP_ERROR_NONE != BspGpio_Write(BSP_GPIO_USER_PIN_IMU_CS, BSP_GPIO_STATE_SET)))
    {
        error = 1;
    }

    return error;
}

static Rover_Error_t RoverImuConfig_ReadAll(void)
{
    RoverImuConfig_Error_t  error = ROVER_IMU_CONFIG_ERROR_NONE;
    lsm6dsv16x_data_ready_t data_ready;

    error |= lsm6dsv16x_flag_data_ready_get(&RoverImuConfig_DeviceHandle, &data_ready);

    if (data_ready.drdy_xl)
    {
        error |= lsm6dsv16x_acceleration_raw_get(&RoverImuConfig_DeviceHandle, RoverImuConfig_RawAccelerometer);

        RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_X] -= RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_X];
        RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_Y] -= RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_Y];
        RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_Z] -= RoverImuConfig_AccelerometerOffset[ROVER_IMU_CONFIG_AXIS_Z];

        /* Correct for IMU orientation in rover */
        RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_X] *= -1;
        RoverImuConfig_RawAccelerometer[ROVER_IMU_CONFIG_AXIS_Y] *= -1;
    }

    if (data_ready.drdy_gy)
    {
        error |= lsm6dsv16x_angular_rate_raw_get(&RoverImuConfig_DeviceHandle, RoverImuConfig_RawGyroscope);

        RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_X] -= RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_X];
        RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_Y] -= RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_Y];
        RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_Z] -= RoverImuConfig_GyroscopeOffset[ROVER_IMU_CONFIG_AXIS_Z];

        /* Correct for IMU orientation in rover */
        RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_X] *= -1;
        RoverImuConfig_RawGyroscope[ROVER_IMU_CONFIG_AXIS_Y] *= -1;
    }

    return RoverImuConfig_ImuToRoverError(error);
}

static Rover_Error_t RoverImuConfig_ReadFifo(void)
{
    lsm6dsv16x_fifo_status_t fifo_status;
    float_t                  quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_MAX] = {
        0U
    };
    float_t                  quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_MAX] = {
        0U
    };
    uint16_t                 game_rotation_vector_samples = 0U;
    RoverImuConfig_Error_t   error                        = lsm6dsv16x_fifo_status_get(&RoverImuConfig_DeviceHandle, &fifo_status);

    for (uint16_t i = 0U; i < fifo_status.fifo_level; i++)
    {
        lsm6dsv16x_fifo_out_raw_t fifo_data;
        error |= lsm6dsv16x_fifo_out_raw_get(&RoverImuConfig_DeviceHandle, &fifo_data);

        switch (fifo_data.tag)
        {
        case LSM6DSV16X_SFLP_GAME_ROTATION_VECTOR_TAG:
            sflp2q(quaternion, (uint16_t *)&fifo_data.data[0]);
            quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_W] += quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_W];
            quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_X] += quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_X];
            quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_Y] += quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_Y];
            quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_Z] += quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_Z];
            game_rotation_vector_samples++;
        default:
            break;
        }
    }

