CAVeRobotics/CAVeware/bsp/boards/STM32-E407/rover_config/src/rover_imu_config.c
    RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_W] = (double)quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_W] / game_rotation_vector_samples;
    RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_X] = (double)quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_X] / game_rotation_vector_samples;
    RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_Y] = (double)quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_Y] / game_rotation_vector_samples;
    RoverImuConfig_Quaternion[ROVER_IMU_CONFIG_QUATERION_AXIS_Z] = (double)quaternion_averaged[ROVER_IMU_CONFIG_QUATERION_AXIS_Z] / game_rotation_vector_samples;

    return RoverImuConfig_ImuToRoverError(error);
}

static inline Rover_Error_t RoverImuConfig_ImuToRoverError(const RoverImuConfig_Error_t error)
{
    Rover_Error_t rover_error = ROVER_ERROR_NONE;

    if (ROVER_IMU_CONFIG_ERROR_NONE != error)
    {
        rover_error = ROVER_ERROR_PERIPHERAL;
    }

    return rover_error;
}

static inline float RoverImuConfig_FsToMilliG(const RoverImuConfig_RawData_t fs)
{
    float                      mg = 0.0f;
    lsm6dsv16x_xl_full_scale_t xl_full_scale;

    (void)lsm6dsv16x_xl_full_scale_get(&RoverImuConfig_DeviceHandle, &xl_full_scale);

    switch (xl_full_scale)
    {
    case LSM6DSV16X_2g:
        mg = lsm6dsv16x_from_fs2_to_mg(fs);
        break;
    case LSM6DSV16X_4g:
        mg = lsm6dsv16x_from_fs4_to_mg(fs);
        break;
    case LSM6DSV16X_8g:
        mg = lsm6dsv16x_from_fs8_to_mg(fs);
        break;
    case LSM6DSV16X_16g:
        mg = lsm6dsv16x_from_fs16_to_mg(fs);
        break;
    default:
        break;
    }

    return mg;
}

static inline Rover_MetersPerSecondSquared_t RoverImuConfig_Fs2ToMetersPerSecondSquared(const RoverImuConfig_RawData_t fs2)
{
    return fs2 * ROVER_IMU_CONFIG_FS2_TO_METERS_PER_SECOND_SQUARED;
}

static inline Rover_MetersPerSecondSquared_t RoverImuConfig_125dpsToRadiansPerSecond(const RoverImuConfig_RawData_t dps)
{
    return dps * ROVER_IMU_CONFIG_125DPS_TO_RADIANS_PER_SECOND;
}

/* Third-party code to handle SFLP quaterion conversion
   Non-compliant, DO NOT MODIFY
   Source: https://github.com/STMicroelectronics/STMems_Standard_C_drivers/blob/master/lsm6dsv16x_STdC/examples/lsm6dsv16x_sensor_fusion.c
 */
static float_t npy_half_to_float(uint16_t h)
{
    union
    {
        float_t ret;
        uint32_t retbits;
    }
    conv;
    conv.retbits = lsm6dsv16x_from_f16_to_f32(h);
    return conv.ret;
}

/* Third-party code to handle SFLP quaterion conversion
   Non-compliant, DO NOT MODIFY
   Source: https://github.com/STMicroelectronics/STMems_Standard_C_drivers/blob/master/lsm6dsv16x_STdC/examples/lsm6dsv16x_sensor_fusion.c
 */
static void sflp2q(float_t quat[4], const uint16_t sflp[3])
{
    float_t sumsq = 0;

    quat[0] = npy_half_to_float(sflp[0]);
    quat[1] = npy_half_to_float(sflp[1]);
    quat[2] = npy_half_to_float(sflp[2]);

    for (uint8_t i = 0; i < 3; i++)
        sumsq += quat[i] * quat[i];

    if (sumsq > 1.0f)
    {
        float_t n = sqrtf(sumsq);
        quat[0] /= n;
        quat[1] /= n;
        quat[2] /= n;
        sumsq    = 1.0f;
    }

    quat[3] = sqrtf(1.0f - sumsq);
}